Revit 2027 API
View.DisplayStyle Property
 The DisplayStyle of the view. Returns DisplayStyle.Wireframe if the view has no display style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DisplayStyle DisplayStyle { get; set; }
Public Property DisplayStyle As DisplayStyle
	Get
	Set
public:
property DisplayStyle DisplayStyle {
	DisplayStyle get ();
	void set (DisplayStyle value);
}
member DisplayStyle : DisplayStyle with get, set
Property Value
DisplayStyle
Exceptions
Exception | Condition
ArgumentException |  When setting this property: DisplayStyle cannot be set to Undefined. -or- When setting this property: DisplayStyle of Drafting Views can be set only to Wireframe or HLR
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: DisplayStyle cannot be modified. -or- When setting this property: This view does not contain display-related properties.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace